Revit 2026 API

# SlabShapeEditorCreateCreasesFromFoldingLines Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void CreateCreasesFromFoldingLines(
	Element hostObj,
	IList<Reference> references
)
```
```vb
Public Sub CreateCreasesFromFoldingLines (
	hostObj As Element,
	references As IList(Of Reference)
)
```
```cpp
public:
void CreateCreasesFromFoldingLines(
	Element^ hostObj,
	IList<Reference^>^ references
)
```
```fsharp
member CreateCreasesFromFoldingLines :
        hostObj : Element *
        references : IList<Reference> -> unit
```

#### Parameters

hostObj Element

references IListReference

#### Reference

SlabShapeEditor Class

Autodesk.Revit.DB Namespace